In [6]:
from datascience import *
import numpy as np

%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')

## Lecture 6 ##

In [7]:
streets = make_array('Bancroft', 'Durant', 'Channing', 'Haste')

In [8]:
southside = Table().with_column(
    'Street', streets,
    'Blocks from Campus', np.arange(4)
)

In [9]:
southside

Street   | Blocks from Campus
Bancroft | 0
Durant   | 1
Channing | 2
Haste    | 3

In [12]:
type(southside.row(0))

datascience.tables.Row

In [13]:
southside = southside.with_row(['Dwight', 4])

In [14]:
southside

Street   | Blocks from Campus
Bancroft | 0
Durant   | 1
Channing | 2
Haste    | 3
Dwight   | 4

In [15]:
southside = southside.with_column('One-Way', ['Yes', 'Yes', 'No', 'Yes', 'Yes'])
southside

Street   | Blocks from Campus | One-Way
Bancroft | 0                  | Yes
Durant   | 1                  | Yes
Channing | 2                  | No
Haste    | 3                  | Yes
Dwight   | 4                  | Yes

In [16]:
southside.column(2)

array(['Yes', 'Yes', 'No', 'Yes', 'Yes'],
      dtype='<U3')

## Discussion ##

In [17]:
nba = Table.read_table('nba_salaries.csv').relabeled(3, 'SALARY').drop(2)
nba

PLAYER           | POSITION | SALARY
Paul Millsap     | PF       | 18.6717
Al Horford       | C        | 12
Tiago Splitter   | C        | 9.75625
Jeff Teague      | PG       | 8
Kyle Korver      | SG       | 5.74648
Thabo Sefolosha  | SF       | 4
Mike Scott       | PF       | 3.33333
Kent Bazemore    | SF       | 2
Dennis Schroder  | PG       | 1.7634
Tim Hardaway Jr. | SG       | 1.30452
... (407 rows omitted)

In [18]:
nba.where(1, 'PG').where('SALARY', are.above(15)).column(0)

array(['Derrick Rose', 'Kyrie Irving', 'Chris Paul', 'Russell Westbrook',
       'John Wall'],
      dtype='<U24')

In [20]:
nba.with_row(['Samosa', 'Mascot', 100])
nba.where('PLAYER', are.containing('Draymo'))

PLAYER         | POSITION | SALARY
Draymond Green | PF       | 14.2609

In [22]:
np.arange(1)

array([0])

In [23]:
np.arange(0)

array([], dtype=int64)

## Census ##

In [24]:
full = Table.read_table('nc-est2014-agesex-res.csv')
full

SEX  | AGE  | CENSUS2010POP | ESTIMATESBASE2010 | POPESTIMATE2010 | POPESTIMATE2011 | POPESTIMATE2012 | POPESTIMATE2013 | POPESTIMATE2014
0    | 0    | 3944153       | 3944160           | 3951330         | 3963071         | 3926665         | 3945610         | 3948350
0    | 1    | 3978070       | 3978090           | 3957888         | 3966510         | 3978006         | 3943077         | 3962123
0    | 2    | 4096929       | 4096939           | 4090862         | 3971573         | 3979952         | 3992690         | 3957772
0    | 3    | 4119040       | 4119051           | 4111920         | 4102501         | 3983049         | 3992425         | 4005190
0    | 4    | 4063170       | 4063186           | 4077552         | 4122303         | 4112638         | 3994047         | 4003448
0    | 5    | 4056858       | 4056872           | 4064653         | 4087713         | 4132210         | 4123408         | 4004858
0    | 6    | 4066381       | 4066412           | 4073013         | 4074979         | 4097780         | 4143094         | 4134352
0    | 7    | 4030579       | 4030594           | 4043047         | 4083240         | 4084964         | 4108615         | 4154000
0    | 8    | 4046486       | 4046497           | 4025604         | 4053206         | 4093213         | 4095827         | 4119524
0    | 9    | 4148353       | 4148369           | 4125415         | 4035769         | 4063193         | 4104133         | 4106832
... (296 rows omitted)

In [25]:
partial = full.select('SEX', 'AGE', 4, 8)
partial

SEX  | AGE  | POPESTIMATE2010 | POPESTIMATE2014
0    | 0    | 3951330         | 3948350
0    | 1    | 3957888         | 3962123
0    | 2    | 4090862         | 3957772
0    | 3    | 4111920         | 4005190
0    | 4    | 4077552         | 4003448
0    | 5    | 4064653         | 4004858
0    | 6    | 4073013         | 4134352
0    | 7    | 4043047         | 4154000
0    | 8    | 4025604         | 4119524
0    | 9    | 4125415         | 4106832
... (296 rows omitted)

In [26]:
simple = partial.relabeled('POPESTIMATE2010', '2010').relabeled(3, '2014')
simple

SEX  | AGE  | 2010    | 2014
0    | 0    | 3951330 | 3948350
0    | 1    | 3957888 | 3962123
0    | 2    | 4090862 | 3957772
0    | 3    | 4111920 | 4005190
0    | 4    | 4077552 | 4003448
0    | 5    | 4064653 | 4004858
0    | 6    | 4073013 | 4134352
0    | 7    | 4043047 | 4154000
0    | 8    | 4025604 | 4119524
0    | 9    | 4125415 | 4106832
... (296 rows omitted)

In [30]:
simple.set_format([2, 3], NumberFormatter)

SEX  | AGE  | 2010      | 2014
0    | 0    | 3,951,330 | 3,948,350
0    | 1    | 3,957,888 | 3,962,123
0    | 2    | 4,090,862 | 3,957,772
0    | 3    | 4,111,920 | 4,005,190
0    | 4    | 4,077,552 | 4,003,448
0    | 5    | 4,064,653 | 4,004,858
0    | 6    | 4,073,013 | 4,134,352
0    | 7    | 4,043,047 | 4,154,000
0    | 8    | 4,025,604 | 4,119,524
0    | 9    | 4,125,415 | 4,106,832
... (296 rows omitted)

In [28]:
simple.sort('AGE', descending=True)

SEX  | AGE  | 2010        | 2014
2    | 999  | 157,257,573 | 161,920,569
1    | 999  | 152,089,484 | 156,936,487
0    | 999  | 309,347,057 | 318,857,056
2    | 100  | 45,058      | 58,468
1    | 100  | 9,351       | 13,729
0    | 100  | 54,409      | 72,197
2    | 99   | 26,074      | 32,791
1    | 99   | 6,104       | 9,037
0    | 99   | 32,178      | 41,828
2    | 98   | 37,533      | 46,536
... (296 rows omitted)